version 1.0;

graph net_2022_03_17T12_15_21(input_0) -> (output_0)
{
    input_0 = external<scalar>(shape = [1, 10, 100]);
    v2_weight = variable<scalar>(label = 'v2_weight', shape = [20, 10, 3]);
    v2_bias = variable<scalar>(label = 'v2_bias', shape = [1, 20]);
    v2_conv = conv(input_0, v2_weight, v2_bias, dilation = [1], padding = [(0, 0)], stride = [1], groups = 1, border = 'constant');
    output_0 = relu(v2_conv);
}
